import java.util.Random;

public abstract class RandomCustomer {
    private static final String telephoneCode = "039\n050\n063\n066\n067\n068\n073\n091\n" +
            "092\n093\n094\n095\n096\n097\n098\n099";

    private static final String city = "Черновцы\n" + "Днепропетровск\n" + "Донецк\n" + "Ивано-Франковск\n" + "Каменец-Подольский\n" + "Харьков\n" + "Херсон\n" +
            "Киев\n" + "Кривой Рог\n" + "Луганск\n" + "Львов\n" + "Николаев\n" + "Одесса\n" + "Полтава\n" + "Сумы\n" +
            "Ужгород\n" + "Запорожье\n" + "Винница\n" + "Черкассы\n" + "Чернигов\n" + "Ильичевск\n" + "Луцк\n" + "Малехов\n" + "Микуличин\n" + "Ровно\n" + "Стрый\n" +
            "Великий Лес\n" + "Великая Омеляна\n" + "Ахтырка\n" + "Белогородка\n" + "Бердянск\n" + "Борисполь\n" + "Бояны\n" + "Бровары\n" + "Буковель\n" + "Бурлачья Балка\n" + "Верховина\n" + "Винники\n" + "Жденево\n" + "Житомир\n" + "Жовтневое\n" + "Затока\n" + "Каменица\n" + "Каролино-Бугаз\n" +
            "Кировоград\n" + "Коблево\n" + "Козин\n" + "Колоденка\n" + "Коропово\n" + "Кременчуг\n" + "Макеевка\n" + "Мукачево";

    private static final String street = "Голливудская аллея славы\n" + "Бульвар Ла-Рамбла\n" + "Орчард-роуд\n" +
            "Кхао Сан Роуд\n" + "Уолл-стрит\n" + "Via Dolorosa.\n" + "Лас-Вегас Стрип\n" + "Елисейские поля\n" +
            "Крещатик\n" + "Владимирская ул.\n" + "б-р Тараса Шевченко\n" + "Улица Пушкинская\n" +
            "ул. Льва Толстого\n" + "Саксаганского ул. ...\n" + "Софиевская\n" + "Архитектора Городецкого ул.\n" +
            "Дерибасовская улица\n" + "Малая Арнаутская улица\n" + "Большая Арнаутская улица\n" +
            "Ланжероновская улица\n" + "Пушкинская улица\n" + "Екатерининская улица\n" + "Приморский бульвар\n" +
            "Маразлиевская улица\n" + "Армянская улица\n" + "Проспект Свободы\n" + "Высокий замок\n" +
            "Богдана Хмельницкого\n" + "Пекарская\n" + "Проспект Шевченко\n" + "Подвальная улица\n" + "Краковская";

    private static final String familiya = "Сысоев\n" + "Ефимов\n" + "Королёв\n" + "Фомин\n" + "Лапин\n" + "Лаврентьев\n" + "Пономарёв\n" +
            "Шамрыло\n" + "Филатов\n" + "Маслов\n" + "Пархоменко\n" + "Ильин\n" + "Пасичник\n" + "Кириллов\n" +
            "Фокин\n" + "Сусаренко\n" + "Ермаков\n" + "Брагин\n" + "Батейко\n" + "Щукин\n" + "Бирюков\n" + "Бирюков\n" +
            "Кравченко\n" + "Маслов\n" + "Молчанов\n" + "Носков\n" + "Игнатьев\n" + "Трофимов\n" + "Антонов\n" +
            "Игнатьев\n" + "Бондаренко\n" + "Лукашенко\n" + "Карпенко-Карый\n" + "Пасичник\n" + "Богданов\n" + "Никитин\n" +
            "Вишняков\n" + "Васильев\n" + "Сафонов\n" + "Сусаренко\n" + "Павленко\n" + "Авдеев\n" + "Родионов\n" + "Бачей\n" +
            "Кулишенко\n" + "Пилипейко\n" + "Маслов\n" + "Каськив\n" + "Котов\n" + "Бобылёв\n" + "Романов\n" +
            "Шкраба\n" + "Сергеев\n" + "Медведев\n" + "Королёв\n" + "Навальный\n" + "Блохин\n" + "Терещенко\n" +
            "Тимошенко\n" + "Алексеев\n" + "Комиссаров\n" + "Цушко\n" + "Зыков\n" + "Выговский\n" + "Кулагин\n" + "Антонов\n" +
            "Терещенко\n" + "Кулишенко\n" + "Шуфрич\n" + "Зайцев\n" + "Анисимов\n" + "Савенко\n" + "Кошелев\n" + "Желиба\n" +
            "Агафонов\n" + "Колесник\n" + "Лапин\n" + "Шубин\n" + "Князев\n" + "Молчанов\n" + "Медведев\n" + "Жуков\n" +
            "Михеев\n" + "Романов\n" + "Шестаков\n" + "Павлов\n" + "Гордеев\n" + "Терещенко\n" + "Гущин\n" + "Суворов\n" +
            "Цушко\n" + "Трофимов\n" + "Шкраба\n" + "Кравченко\n" + "Хижняк\n" + "Сысоев\n" + "Бородай\n" + "Тимошенко\n" + "Ерёменко";

    private static final String name = "Огюст\n" + "Шарль\n" + "Чеслав\n" + "Сава\n" + "Рафаил\n" + "Устин\n" + "Жигер\n" + "Устин\n" +
            "Павел\n" + "Платон\n" + "Юлиан\n" + "Гордей\n" + "Динар\n" + "Зигмунд\n" + "Евгений\n" + "Эдуард\n" +
            "Тарас\n" + "Чарльз\n" + "Илларион\n" + "Максим\n" + "Лев\n" + "Цезарь\n" + "Рафаил\n" + "Никита\n" +
            "Богдан\n" + "Юлий\n" + "Лукьян\n" + "Назар\n" + "Шарль\n" + "Сава\n" + "Донат\n" + "Назар\n" +
            "Огюст\n" + "Зенон\n" + "Шамиль\n" + "Иван\n" + "Харитон\n" + "Харитон\n" + "Спартак\n" +
            "Фёдор\n" + "Ефрем\n" + "Святослав\n" + "Оливер\n" + "Ираклий\n" + "Устин\n" + "Фёдор\n" + "Денис\n" + "Леон\n" +
            "Шамиль\n" + "Цицерон\n" + "Макар\n" + "Устин\n" + "Лукьян\n" + "Павел\n" + "Клаус\n" +
            "Остап\n" + "Роберт\n" + "Харитон\n" + "Цезарь\n" + "Цицерон\n" + "Олег\n" + "Феликс\n" + "Яков\n" + "Карл\n" +
            "Богдан\n" + "Феликс\n" + "Иван\n" + "Игнатий\n" + "Йосеф\n" + "Клаус\n" + "Эрик\n" + "Илларион\n" + "Эрик\n" +
            "Кир\n" + "Цезарь\n" + "Евстахий\n" + "Иосиф\n" + "Александр\n" + "Емельян\n" + "Устин\n" + "Феликс\n" +
            "Лоренс\n" + "Евдоким\n" + "Павел\n" + "Ким\n" + "Цефас\n" + "Тарас\n" + "Бронислав\n" + "Вадим\n" + "Шарль\n" +
            "Еремей\n" + "Ким\n" + "Чарльз\n" + "Шарль\n" + "Николай\n" + "Георгий\n" + "Цицерон\n" + "Клаус\n" + "Роман";

    private static final String otchestvo = "Максимович\n" +
            "Анатолиевич\n" + "Григорьевич\n" + "Львович\n" + "Викторович\n" +
            "Виталиевич\n" + "Васильевич\n" + "Александрович\n" + "Иванович\n" + "Ярославович\n" + "Васильевич\n" + "Петрович\n" +
            "Валериевич\n" + "Андреевич\n" + "Петрович\n" + "Станиславович\n" + "Сергеевич\n" + "Иванович\n" + "Викторович\n" + "Данилович\n" +
            "Максимович\n" + "Брониславович\n" + "Евгеньевич\n" + "Максимович\n" + "Владимирович\n" + "Анатолиевич\n" + "Артёмович\n" +
            "Алексеевич\n" + "Алексеевич\n" + "Андреевич\n" + "Дмитриевич\n" + "Платонович\n" + "Евгеньевич\n" + "Сергеевич\n" +
            "Данилович\n" + "Сергеевич\n" + "Максимович\n" + "Викторович\n" + "Богданович\n" + "Вадимович\n" + "Данилович\n" +
            "Станиславович\n" + "Платонович\n" + "Юхимович\n" + "Дмитриевич\n" + "Артёмович\n" + "Андреевич\n" + "Михайлович\n" + "Борисович\n" +
            "Иванович\n" + "Львович\n" + "Данилович\n" + "Петрович\n" + "Анатолиевич\n" + "Максимович\n" + "Максимович\n" +
            "Дмитриевич\n" + "Фёдорович\n" + "Борисович\n" + "Фёдорович\n" + "Романович\n" + "Владимирович\n" + "Леонидович\n" +
            "Ярославович\n" + "Данилович\n" + "Максимович\n" + "Александрович\n" + "Станиславович\n" + "Леонидович\n" + "Ярославович\n" + "Станиславович\n" +
            "Андреевич\n" + "Романович\n" + "Леонидович\n" + "Леонидович\n" + "Артёмович\n" + "Владимирович\n" + "Александрович\n" +
            "Львович\n" + "Григорьевич\n" + "Романович\n" + "Анатолиевич\n" + "Валериевич\n" + "Борисович\n" + "Васильевич\n" +
            "Сергеевич\n" + "Эдуардович\n" + "Борисович\n" + "Сергеевич\n" + "Алексеевич\n" + "Дмитриевич\n" + "Анатолиевич\n" +
            "Валериевич\n" + "Григорьевич\n" + "Данилович\n" + "Романович\n" + "Михайлович\n" + "Станиславович\n" + "Виталиевич";

    private static int generateRandomDigits(int n) {
        int m = (int) Math.pow(10, n - 1);
        return m + new Random().nextInt(9 * m);
    }

    private static String generateRandomCreditCard() {
        return generateRandomDigits(4) + " " + generateRandomDigits(4) + " " +
                generateRandomDigits(4) + " " + generateRandomDigits(4);
    }

    private static String getRandomTelephone() {
        String[] tel = telephoneCode.split("\n");
        int telephone;
        telephone = (int) ((Math.random() * 9000000) + 1000000);
        return tel[getRandom(tel.length)] + "-" + telephone;
    }

    private static int getRandom(int count) {
        Random r = new Random();
        return r.nextInt(count);
    }

    public static Phone getCustomer() {
        String[] cit = city.split("\n");
        String[] yl = street.split("\n");

        String[] fam = familiya.split("\n");
        String[] nam = name.split("\n");
        String[] otch = otchestvo.split("\n");

        Phone.Address address = new Phone.Address("Украина", cit[getRandom(cit.length)], yl[getRandom(yl.length)],
                String.valueOf(getRandom(100)), String.valueOf(getRandom(200)));

        return new Phone(fam[getRandom(fam.length)], nam[getRandom(nam.length)], otch[getRandom(otch.length)], address,
                getRandomTelephone(), generateRandomCreditCard(), generateRandomDigits(8), generateRandomDigits(8),
                generateRandomDigits(8), generateRandomDigits(8), generateRandomDigits(6));
    }

}
